---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TilePatternGridCellsY
source: html/555afc16-416c-cf22-e978-c68c6fe0c63e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TilePatternGridCellsY Property

"Number of vertical cells"

## Syntax (C#)
```csharp
public static ForgeTypeId TilePatternGridCellsY { get; }
```